regtests/soap2.out

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
<soap:Body>
<awsns:Workorder xmlns:awsns="http://soapaws/">
<my_record_out>
   <name1 xsi:type="xsd:string">Wo1</name1>
   <name2 xsi:type="xsd:string">idle</name2>
   <my_array soapenc:arrayType="awsns:my_record[1]" xsi:type="soapenc:Array">
      <my_record>
         <name3 xsi:type="xsd:string">idle</name3>
         <name4 xsi:type="xsd:string">Wo1</name4>
      </my_record>
   </my_array>
</my_record_out>
</awsns:Workorder>
</soap:Body>
</soap:Envelope>


Payload coding/decoding is ok
